# Merge

In [1]:
import pandas as pd
import numpy as np

### Create 3 differents Series, each of length 100, as follows:
##### The first a random number from 1 to 4
##### The second a random number from 1 to 3
##### The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, high = 5, size = 100, dtype = "l"))
s2 = pd.Series(np.random.randint(1, high = 4, size = 100, dtype = "l"))
s3 = pd.Series(np.random.randint(10000, high = 30001, size = 100, dtype = "l"))

In [3]:
s1

0     3
1     3
2     3
3     4
4     4
     ..
95    4
96    1
97    1
98    1
99    2
Length: 100, dtype: int64

#### Create a DataFrame by joinning the Series by column

In [5]:
df = pd.concat([s1, s2, s3], axis = 1)
df

    0  1      2
0   3  2  11996
1   3  1  18200
2   3  1  21177
3   4  1  14821
4   4  1  21283
.. .. ..    ...
95  4  1  11935
96  1  2  27437
97  1  2  23738
98  1  2  20205
99  2  2  18261

[100 rows x 3 columns]

#### Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [8]:
df.rename( columns = {0: "bebrs", 1: "bathrs", 2:"price_sqr_meter"}, inplace = True)
df

    bebrs  bathrs  price_sqr_meter
0       3       2            11996
1       3       1            18200
2       3       1            21177
3       4       1            14821
4       4       1            21283
..    ...     ...              ...
95      4       1            11935
96      1       2            27437
97      1       2            23738
98      1       2            20205
99      2       2            18261

[100 rows x 3 columns]

#### Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [10]:
bigcolumn = pd.concat([s1, s2, s3], axis = 0)
bigcolumn

0         3
1         3
2         3
3         4
4         4
      ...
95    11935
96    27437
97    23738
98    20205
99    18261
Length: 300, dtype: int64

In [11]:
bigcolumn = bigcolumn.to_frame()
bigcolumn

        0
0       3
1       3
2       3
3       4
4       4
..    ...
95  11935
96  27437
97  23738
98  20205
99  18261

[300 rows x 1 columns]

#### What is the length of the DataFrame?

In [12]:
len(bigcolumn)

300

#### Reindex the DataFrame so it goes from 0 to 299